In [205]:
import pandas as pd
import numpy as np

# Read file

In [206]:
df=pd.read_csv("titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Check all columns

In [207]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

# Check shape of Data

In [208]:
df.shape

(891, 12)

# Check info of Data

In [209]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# Describe INT Data

In [210]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# Describe STR Data

In [211]:
df.describe(include="object")

                             Name   Sex Ticket    Cabin Embarked
count                         891   891    891      204      889
unique                        891     2    681      147        3
top     Johansson, Mr. Karl Johan  male   1601  B96 B98        S
freq                            1   577      7        4      644

# Check Null Values in Data

In [212]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

# Check Null value in percentage

In [213]:
df.isna().sum()/df.shape[0]*100

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [214]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [215]:
df.shape

(891, 12)

# Drop columns

In [216]:
df.drop(columns="Cabin",inplace=True)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [217]:
df.shape

(891, 11)

# Check Mean of Age

In [218]:
df["Age"].mean()

29.69911764705882

# Check Median of Age

In [219]:
df["Age"].median()

28.0

# Fill Missing Values of Age

In [220]:
df["Age"].fillna(df["Age"].mean(),inplace=True)

# Check Mode of Embarked

In [221]:
df["Embarked"].mode()

0    S
dtype: object

# Fill Missing Data of Embarked  (Str Data)

In [222]:
df["Embarked"].fillna(df["Embarked"].mode()[0],inplace=True)

# Check Data Info Again After Cleaning Data

In [223]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

# Check Missing Values Ater Cleaning

In [224]:
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

# ++++++Finally Our Data is Clean++++++

In [225]:
df.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,S

In [226]:
df.shape

(891, 11)

In [227]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

# Check Survived value_counts

In [228]:
df["Survived"].value_counts()   # In numbers

0    549
1    342
Name: Survived, dtype: int64

In [229]:
df["Survived"].value_counts()/df.shape[0]*100   # In percentage

0    61.616162
1    38.383838
Name: Survived, dtype: float64

# Check Pclass value_counts & unique values

In [230]:
df["Pclass"].value_counts()                  # In numbers

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [231]:
df["Pclass"].value_counts()/df.shape[0]*100  # In percentage

3    55.106622
1    24.242424
2    20.650954
Name: Pclass, dtype: float64

In [232]:
df["Pclass"].unique()

array([3, 1, 2], dtype=int64)

# Check Mean of Pclass Indivisually

In [233]:
x=df[df["Pclass"]==1]
x["Fare"].mean()

84.15468749999992

In [234]:
y=df[df["Pclass"]==2]
y["Fare"].mean()

20.66218315217391

In [235]:
z=df[df["Pclass"]==3]
z["Fare"].mean()

13.675550101832997

# Check Sex value_counts

In [236]:
df["Sex"].value_counts()                     # In numbers

male      577
female    314
Name: Sex, dtype: int64

In [237]:
df["Sex"].value_counts()/df.shape[0]*100     # In percentage

male      64.758698
female    35.241302
Name: Sex, dtype: float64

In [238]:
y.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0,S

# Set New Index as PassengerId

In [239]:
df.set_index("PassengerId",inplace=True)

In [240]:
df.head(3)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
PassengerId,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S

# Search and Filter Data  with np.where

Max Age with Max Fare

In [241]:
df.iloc[np.where((df["Age"]==max(df["Age"])) | (df["Fare"]==max(df["Fare"])))]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
PassengerId,,,,,,,,,,
259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,C
631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,S
680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,C
738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,C

Min Age & Min Fare

In [242]:
df.iloc[np.where((df["Age"]==min(df["Age"])) | (df["Fare"]==min(df["Fare"])))]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
PassengerId,,,,,,,,,,
180,0,3,"Leonard, Mr. Lionel",male,36.000000,0,0,LINE,0.0000,S
264,0,1,"Harrison, Mr. William",male,40.000000,0,0,112059,0.0000,S
272,1,3,"Tornquist, Mr. William Henry",male,25.000000,0,0,LINE,0.0000,S
278,0,2,"Parkes, Mr. Francis ""Frank""",male,29.699118,0,0,239853,0.0000,S
303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.000000,0,0,LINE,0.0000,S
414,0,2,"Cunningham, Mr. Alfred Fleming",male,29.699118,0,0,239853,0.0000,S
467,0,2,"Campbell, Mr. William",male,29.699118,0,0,239853,0.0000,S
482,0,2,"Frost, Mr. Anthony Wood ""Archie""",male,29.699118,0,0,239854,0.0000,S
598,0,3,"Johnson, Mr. Alfred",male,49.000000,0,0,LINE,0.0000,S
634,0,1,"Parr, Mr. William Henry Marsh",male,29.699118,0,0,112052,0.0000,S
675,0,2,"Watson, Mr. Ennis Hastings",male,29.699118,0,0,239856,0.0000,S
733,0,2,"Knight, Mr. Robert J",male,29.699118,0,0,239855,0.0000,S
804,1,3,"Thomas, Master. Assad Alexander",male,0.420000,0,1,2625,8.5167,C
807,0,1,"Andrews, Mr. Thomas Jr",male,39.000000,0,0,112050,0.0000,S
816,0,1,"Fry, Mr. Richard",male,29.699118,0,0,112058,0.0000,S
823,0,1,"Reuchlin, Jonkheer. John George",male,38.000000,0,0,19972,0.0000,S

# Check Age Min & Max

In [243]:
df["Age"].min()

0.42

In [244]:
df["Age"].max()

80.0

# Check Fare Min & Max

In [245]:
df["Fare"].min()

0.0

In [246]:
df["Fare"].max()

512.3292

# Search and Filter Data  without np.where

In [247]:
df[(df["Age"]>35.0) & (df["Fare"]>100.0)]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
PassengerId,,,,,,,,,,
196,1,1,"Lurette, Miss. Elise",female,58.0,0,0,PC 17569,146.5208,C
269,1,1,"Graham, Mrs. William Thompson (Edith Junkins)",female,58.0,0,1,PC 17582,153.4625,S
300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,C
320,1,1,"Spedden, Mrs. Frederic Oakley (Margaretta Corn...",female,40.0,1,1,16966,134.5000,C
326,1,1,"Young, Miss. Marie Grice",female,36.0,0,0,PC 17760,135.6333,C
333,0,1,"Graham, Mr. George Edward",male,38.0,0,1,PC 17582,153.4625,S
338,1,1,"Burns, Miss. Elizabeth Margaret",female,41.0,0,0,16966,134.5000,C
381,1,1,"Bidois, Miss. Rosalie",female,42.0,0,0,PC 17757,227.5250,C
391,1,1,"Carter, Mr. William Ernest",male,36.0,1,2,113760,120.0000,S
439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,S
545,0,1,"Douglas, Mr. Walter Donald",male,50.0,1,0,PC 17761,106.4250,C
582,1,1,"Thayer, Mrs. John Borland (Marian Longstreth M...",female,39.0,1,1,17421,110.8833,C
610,1,1,"Shutes, Miss. Elizabeth W",female,40.0,0,0,PC 17582,153.4625,S
660,0,1,"Newell, Mr. Arthur Webster",male,58.0,0,2,35273,113.2750,C
661,1,1,"Frauenthal, Dr. Henry William",male,50.0,2,0,PC 17611,133.6500,S
680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,C
699,0,1,"Thayer, Mr. John Borland",male,49.0,1,1,17421,110.8833,C
717,1,1,"Endres, Miss. Caroline Louise",female,38.0,0,0,PC 17757,227.5250,C
764,1,1,"Carter, Mrs. William Ernest (Lucile Polk)",female,36.0,1,2,113760,120.0000,S
780,1,1,"Robert, Mrs. Edward Scott (Elisabeth Walton Mc...",female,43.0,0,1,24160,211.3375,S
857,1,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,1,1,36928,164.8667,S

# Average Fare for Male and Female

Male

In [248]:
df.iloc[np.where((df["Sex"]=="male"))]["Fare"].mean()    # with np.where

25.523893414211418

In [249]:
df[df["Sex"]=="male"]["Fare"].mean()                     # without np.where

25.523893414211418

In [250]:
df["Fare"].max()

512.3292

Female

In [251]:
df.iloc[np.where((df["Sex"]=="female"))]["Fare"].mean()   # with np.where

44.47981783439487

In [252]:
df[df["Sex"]=="male"]["Fare"].mean()                      # without np.where

25.523893414211418

In [253]:
df["Fare"].max()

512.3292

# Groupby for make detailed view

For Calculating Fare

In [254]:
df.groupby(["Sex"])["Fare"].agg(["mean","min","max","sum","count"])

             mean   min       max         sum  count
Sex
female  44.479818  6.75  512.3292  13966.6628    314
male    25.523893  0.00  512.3292  14727.2865    577

How many survived

In [255]:
df.groupby(["Sex"])["Survived"].value_counts()

Sex     Survived
female  1           233
        0            81
male    0           468
        1           109
Name: Survived, dtype: int64

How many survived according to Pclass

In [256]:
df.groupby(["Pclass","Sex"])["Survived"].value_counts()

Pclass  Sex     Survived
1       female  1            91
                0             3
        male    0            77
                1            45
2       female  1            70
                0             6
        male    0            91
                1            17
3       female  0            72
                1            72
        male    0           300
                1            47
Name: Survived, dtype: int64

# Change Data Type of columns

In [257]:
df["Survived"].dtype

dtype('int64')

In [258]:
df["Survived"]=df["Survived"].astype("object")

In [259]:
df["Survived"].dtype

dtype('O')

In [260]:
df["Survived"]=df["Survived"].astype(int)

In [261]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int32
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       891 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Embarked  891 non-null    object
dtypes: float64(2), int32(1), int64(3), object(4)
memory usage: 105.4+ KB

# Groupby for count & sum

In [262]:
df.groupby(["Pclass","Sex"])["Survived"].agg(["count","sum"])

               count  sum
Pclass Sex
1      female     94   91
       male      122   45
2      female     76   70
       male      108   17
3      female    144   72
       male      347   47

# ------ Feature Engineering ------

## I'am creating a new column by the name family size which will be the sum of SibSp and Parch

In [263]:
df["Family_size"]=df["SibSp"]+df["Parch"]

In [264]:
df.head(2)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Family_size
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,1
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,1

In [265]:
df.drop(columns=["SibSp","Parch"],inplace=True)

# New Data created

In [266]:
df.head(2)

,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Embarked,Family_size
PassengerId,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,S,1
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C,1

# Check Value_counts of Family_size

In [267]:
df["Family_size"].value_counts()

0     537
1     161
2     102
3      29
5      22
4      15
6      12
10      7
7       6
Name: Family_size, dtype: int64

# Check Unique of Family_size

In [268]:
df["Family_size"].unique()

array([ 1,  0,  4,  2,  6,  5,  3,  7, 10], dtype=int64)

In [269]:
df

,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Embarked,Family_size
PassengerId,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.000000,A/5 21171,7.2500,S,1
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,PC 17599,71.2833,C,1
3,1,3,"Heikkinen, Miss. Laina",female,26.000000,STON/O2. 3101282,7.9250,S,0
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,113803,53.1000,S,1
5,0,3,"Allen, Mr. William Henry",male,35.000000,373450,8.0500,S,0
...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.000000,211536,13.0000,S,0
888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,112053,30.0000,S,0
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,W./C. 6607,23.4500,S,3
890,1,1,"Behr, Mr. Karl Howell",male,26.000000,111369,30.0000,C,0
891,0,3,"Dooley, Mr. Patrick",male,32.000000,370376,7.7500,Q,0

# Store columns in a List as col

In [275]:
col=list(df.columns)
col

['Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'Ticket',
 'Fare',
 'Embarked',
 'Family_size']

# Shifting place of column Family_size

In [281]:
df=df[col[0:2]+[col[-1]]+col[2:8]]

In [283]:
df.head()

,Survived,Pclass,Family_size,Name,Sex,Age,Ticket,Fare,Embarked
PassengerId,,,,,,,,,
1,0,3,1,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,S
2,1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C
3,1,3,0,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,S
4,1,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,S
5,0,3,0,"Allen, Mr. William Henry",male,35.0,373450,8.0500,S